grygorek/FreeRTOS_cpp11/lib_test_nxp_mk64/startup_mk64f12.cpp
//*****************************************************************************
// MK64F12 startup code for use with MCUXpresso IDE
//
// Version : 010818
//*****************************************************************************
//
// Copyright 2016-2018 NXP
//
// SPDX-License-Identifier: BSD-3-Clause
//*****************************************************************************

/// @file
///
/// @author: Piotr Grygorczuk grygorek@gmail.com
///
/// @copyright Copyright 2019 Piotr Grygorczuk
/// All rights reserved.
///
/// Redistribution and use in source and binary forms, with or without
/// modification, are permitted provided that the following conditions are met:
///
/// o Redistributions of source code must retain the above copyright notice,
///   this list of conditions and the following disclaimer.
///
/// o Redistributions in binary form must reproduce the above copyright notice,
///   this list of conditions and the following disclaimer in the documentation
///   and/or other materials provided with the distribution.
///
/// o My name may not be used to endorse or promote products derived from this
///   software without specific prior written permission.
///
/// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
/// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
/// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
/// ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
/// LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
/// CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
/// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
/// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
/// CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
/// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
/// POSSIBILITY OF SUCH DAMAGE.
///

#if defined(DEBUG)
#pragma GCC push_options
#pragma GCC optimize("Og")
#endif // (DEBUG)

#if defined(__cplusplus)
#ifdef __REDLIB__
#error Redlib does not support C++
#else

#include "FreeRTOS.h"
#include "task.h"

//*****************************************************************************
//
// The entry point for the C++ library startup
//
//*****************************************************************************
extern "C"
{
  extern void __libc_init_array(void);
}
#endif
#endif

#define WEAK __attribute__((weak))
#define WEAK_AV __attribute__((weak, section(".after_vectors")))
#define ALIAS(f) __attribute__((weak, alias(#f)))

//*****************************************************************************
#if defined(__cplusplus)
extern "C"
{
#endif

  //*****************************************************************************
  // Flash Configuration block : 16-byte flash configuration field that stores
  // default protection settings (loaded on reset) and security information that
  // allows the MCU to restrict access to the Flash Memory module.
  // Placed at address 0x400 by the linker script.
  //*****************************************************************************
  __attribute__((used, section(".FlashConfig"))) const struct
  {
    unsigned int word1;
    unsigned int word2;
    unsigned int word3;
    unsigned int word4;
  } Flash_Config = {0xFFFFFFFF, 0xFFFFFFFF, 0xFFFFFFFF, 0xFFFFFFFE};
//*****************************************************************************
// Declaration of external SystemInit function
//*****************************************************************************
#if defined(__USE_CMSIS)
  extern void SystemInit(void);
#endif // (__USE_CMSIS)

  //*****************************************************************************
  // Forward declaration of the core exception handlers.
  // When the application defines a handler (with the same name), this will
  // automatically take precedence over these weak definitions.
  // If your application is a C++ one, then any interrupt handlers defined
  // in C++ files within in your main application will need to have C linkage
  // rather than C++ linkage. To do this, make sure that you are using extern "C"
  // { .... } around the interrupt handler within your main application code.
  //*****************************************************************************
  void ResetISR(void);
  WEAK void NMI_Handler(void);
  WEAK void HardFault_Handler(void);
  WEAK void MemManage_Handler(void);
  WEAK void BusFault_Handler(void);
  WEAK void UsageFault_Handler(void);
  WEAK void SVC_Handler(void);
  WEAK void DebugMon_Handler(void);
  WEAK void PendSV_Handler(void);
  WEAK void SysTick_Handler(void);
  WEAK void IntDefaultHandler(void);

  //*****************************************************************************
  // Forward declaration of the application IRQ handlers. When the application
  // defines a handler (with the same name), this will automatically take
  // precedence over weak definitions below
  //*****************************************************************************
  WEAK void DMA0_IRQHandler(void);
  WEAK void DMA1_IRQHandler(void);
  WEAK void DMA2_IRQHandler(void);
  WEAK void DMA3_IRQHandler(void);
  WEAK void DMA4_IRQHandler(void);
  WEAK void DMA5_IRQHandler(void);
  WEAK void DMA6_IRQHandler(void);
  WEAK void DMA7_IRQHandler(void);
  WEAK void DMA8_IRQHandler(void);
  WEAK void DMA9_IRQHandler(void);
  WEAK void DMA10_IRQHandler(void);
  WEAK void DMA11_IRQHandler(void);
  WEAK void DMA12_IRQHandler(void);
  WEAK void DMA13_IRQHandler(void);
  WEAK void DMA14_IRQHandler(void);
  WEAK void DMA15_IRQHandler(void);
  WEAK void DMA_Error_IRQHandler(void);
  WEAK void MCM_IRQHandler(void);
  WEAK void FTFE_IRQHandler(void);
  WEAK void Read_Collision_IRQHandler(void);
  WEAK void LVD_LVW_IRQHandler(void);
  WEAK void LLWU_IRQHandler(void);
  WEAK void WDOG_EWM_IRQHandler(void);
  WEAK void RNG_IRQHandler(void);
  WEAK void I2C0_IRQHandler(void);
  WEAK void I2C1_IRQHandler(void);
  WEAK void SPI0_IRQHandler(void);
  WEAK void SPI1_IRQHandler(void);
  WEAK void I2S0_Tx_IRQHandler(void);
  WEAK void I2S0_Rx_IRQHandler(void);
  WEAK void UART0_LON_IRQHandler(void);
  WEAK void UART0_RX_TX_IRQHandler(void);
  WEAK void UART0_ERR_IRQHandler(void);
  WEAK void UART1_RX_TX_IRQHandler(void);
  WEAK void UART1_ERR_IRQHandler(void);
  WEAK void UART2_RX_TX_IRQHandler(void);
  WEAK void UART2_ERR_IRQHandler(void);
  WEAK void UART3_RX_TX_IRQHandler(void);
  WEAK void UART3_ERR_IRQHandler(void);
  WEAK void ADC0_IRQHandler(void);
  WEAK void CMP0_IRQHandler(void);
  WEAK void CMP1_IRQHandler(void);
  WEAK void FTM0_IRQHandler(void);
  WEAK void FTM1_IRQHandler(void);
  WEAK void FTM2_IRQHandler(void);
  WEAK void CMT_IRQHandler(void);
  WEAK void RTC_IRQHandler(void);
  WEAK void RTC_Seconds_IRQHandler(void);
  WEAK void PIT0_IRQHandler(void);
  WEAK void PIT1_IRQHandler(void);
  WEAK void PIT2_IRQHandler(void);
  WEAK void PIT3_IRQHandler(void);
  WEAK void PDB0_IRQHandler(void);
  WEAK void USB0_IRQHandler(void);
  WEAK void USBDCD_IRQHandler(void);
  WEAK void Reserved71_IRQHandler(void);
  WEAK void DAC0_IRQHandler(void);
  WEAK void MCG_IRQHandler(void);
  WEAK void LPTMR0_IRQHandler(void);
  WEAK void PORTA_IRQHandler(void);
  WEAK void PORTB_IRQHandler(void);
  WEAK void PORTC_IRQHandler(void);
  WEAK void PORTD_IRQHandler(void);
  WEAK void PORTE_IRQHandler(void);
  WEAK void SWI_IRQHandler(void);
  WEAK void SPI2_IRQHandler(void);
  WEAK void UART4_RX_TX_IRQHandler(void);
  WEAK void UART4_ERR_IRQHandler(void);
  WEAK void UART5_RX_TX_IRQHandler(void);
  WEAK void UART5_ERR_IRQHandler(void);
  WEAK void CMP2_IRQHandler(void);
  WEAK void FTM3_IRQHandler(void);
  WEAK void DAC1_IRQHandler(void);
  WEAK void ADC1_IRQHandler(void);
  WEAK void I2C2_IRQHandler(void);
  WEAK void CAN0_ORed_Message_buffer_IRQHandler(void);
  WEAK void CAN0_Bus_Off_IRQHandler(void);
  WEAK void CAN0_Error_IRQHandler(void);
  WEAK void CAN0_Tx_Warning_IRQHandler(void);
  WEAK void CAN0_Rx_Warning_IRQHandler(void);
  WEAK void CAN0_Wake_Up_IRQHandler(void);
  WEAK void SDHC_IRQHandler(void);
  WEAK void ENET_1588_Timer_IRQHandler(void);
  WEAK void ENET_Transmit_IRQHandler(void);
  WEAK void ENET_Receive_IRQHandler(void);
  WEAK void ENET_Error_IRQHandler(void);

  //*****************************************************************************
  // Forward declaration of the driver IRQ handlers. These are aliased
  // to the IntDefaultHandler, which is a 'forever' loop. When the driver
  // defines a handler (with the same name), this will automatically take
  // precedence over these weak definitions
  //*****************************************************************************
  void DMA0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DMA1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DMA2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DMA3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DMA4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DMA5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DMA6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DMA7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DMA8_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DMA9_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DMA10_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DMA11_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DMA12_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DMA13_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DMA14_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DMA15_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DMA_Error_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void MCM_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void FTFE_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void Read_Collision_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void LVD_LVW_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void LLWU_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void WDOG_EWM_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void RNG_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void I2C0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void I2C1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void SPI0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void SPI1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void I2S0_Tx_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void I2S0_Rx_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void UART0_LON_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void UART0_RX_TX_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void UART0_ERR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void UART1_RX_TX_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void UART1_ERR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void UART2_RX_TX_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void UART2_ERR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void UART3_RX_TX_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void UART3_ERR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void ADC0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void CMP0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void CMP1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void FTM0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void FTM1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void FTM2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void CMT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void RTC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void RTC_Seconds_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void PIT0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void PIT1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void PIT2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void PIT3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void PDB0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void USB0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void USBDCD_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void Reserved71_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DAC0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void MCG_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void LPTMR0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void PORTA_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void PORTB_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void PORTC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void PORTD_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void PORTE_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void SWI_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void SPI2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void UART4_RX_TX_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void UART4_ERR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void UART5_RX_TX_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void UART5_ERR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void CMP2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void FTM3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void DAC1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void ADC1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void I2C2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void CAN0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void SDHC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void ENET_1588_Timer_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void ENET_Transmit_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void ENET_Receive_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
  void ENET_Error_DriverIRQHandler(void) ALIAS(IntDefaultHandler);

//*****************************************************************************
// The entry point for the application.
// __main() is the entry point for Redlib based applications
// main() is the entry point for Newlib based applications
//*****************************************************************************
#if defined(__REDLIB__)
  extern void __main(void);
#endif
  extern int main(void);

  void free_rtos_main(void *)
  {
    main();
  }

  //*****************************************************************************
  // External declaration for the pointer to the stack top from the Linker Script
  //*****************************************************************************
  extern void _vStackTop(void);
//*****************************************************************************
#if defined(__cplusplus)
} // extern "C"
#endif
//*****************************************************************************
// The vector table.
// This relies on the linker script to place at correct location in memory.
//*****************************************************************************
extern void (*const g_pfnVectors[])(void);
extern void *__Vectors __attribute__((alias("g_pfnVectors")));

__attribute__((used, section(".isr_vector"))) void (*const g_pfnVectors[])(void) = {
    // Core Level - CM4
    &_vStackTop,        // The initial stack pointer
    ResetISR,           // The reset handler
    NMI_Handler,        // The NMI handler
    HardFault_Handler,  // The hard fault handler
    MemManage_Handler,  // The MPU fault handler
    BusFault_Handler,   // The bus fault handler
    UsageFault_Handler, // The usage fault handler
    0,                  // Reserved
    0,                  // Reserved
    0,                  // Reserved
    0,                  // Reserved
    SVC_Handler,        // SVCall handler
    DebugMon_Handler,   // Debug monitor handler
    0,                  // Reserved
    PendSV_Handler,     // The PendSV handler
    SysTick_Handler,    // The SysTick handler

    // Chip Level - MK64F12
    DMA0_IRQHandler,                     // 16 : DMA Channel 0 Transfer Complete
    DMA1_IRQHandler,                     // 17 : DMA Channel 1 Transfer Complete
    DMA2_IRQHandler,                     // 18 : DMA Channel 2 Transfer Complete
    DMA3_IRQHandler,                     // 19 : DMA Channel 3 Transfer Complete
    DMA4_IRQHandler,                     // 20 : DMA Channel 4 Transfer Complete
    DMA5_IRQHandler,                     // 21 : DMA Channel 5 Transfer Complete
    DMA6_IRQHandler,                     // 22 : DMA Channel 6 Transfer Complete
    DMA7_IRQHandler,                     // 23 : DMA Channel 7 Transfer Complete
    DMA8_IRQHandler,                     // 24 : DMA Channel 8 Transfer Complete
    DMA9_IRQHandler,                     // 25 : DMA Channel 9 Transfer Complete
    DMA10_IRQHandler,                    // 26 : DMA Channel 10 Transfer Complete
    DMA11_IRQHandler,                    // 27 : DMA Channel 11 Transfer Complete
    DMA12_IRQHandler,                    // 28 : DMA Channel 12 Transfer Complete
    DMA13_IRQHandler,                    // 29 : DMA Channel 13 Transfer Complete
    DMA14_IRQHandler,                    // 30 : DMA Channel 14 Transfer Complete
    DMA15_IRQHandler,                    // 31 : DMA Channel 15 Transfer Complete
    DMA_Error_IRQHandler,                // 32 : DMA Error Interrupt
    MCM_IRQHandler,                      // 33 : Normal Interrupt
    FTFE_IRQHandler,                     // 34 : FTFE Command complete interrupt
    Read_Collision_IRQHandler,           // 35 : Read Collision Interrupt
    LVD_LVW_IRQHandler,                  // 36 : Low Voltage Detect, Low Voltage Warning
    LLWU_IRQHandler,                     // 37 : Low Leakage Wakeup Unit
    WDOG_EWM_IRQHandler,                 // 38 : WDOG Interrupt
    RNG_IRQHandler,                      // 39 : RNG Interrupt
    I2C0_IRQHandler,                     // 40 : I2C0 interrupt
    I2C1_IRQHandler,                     // 41 : I2C1 interrupt
    SPI0_IRQHandler,                     // 42 : SPI0 Interrupt
    SPI1_IRQHandler,                     // 43 : SPI1 Interrupt
    I2S0_Tx_IRQHandler,                  // 44 : I2S0 transmit interrupt
    I2S0_Rx_IRQHandler,                  // 45 : I2S0 receive interrupt
    UART0_LON_IRQHandler,                // 46 : UART0 LON interrupt
    UART0_RX_TX_IRQHandler,              // 47 : UART0 Receive/Transmit interrupt
    UART0_ERR_IRQHandler,                // 48 : UART0 Error interrupt
    UART1_RX_TX_IRQHandler,              // 49 : UART1 Receive/Transmit interrupt
    UART1_ERR_IRQHandler,                // 50 : UART1 Error interrupt
    UART2_RX_TX_IRQHandler,              // 51 : UART2 Receive/Transmit interrupt
    UART2_ERR_IRQHandler,                // 52 : UART2 Error interrupt
    UART3_RX_TX_IRQHandler,              // 53 : UART3 Receive/Transmit interrupt
    UART3_ERR_IRQHandler,                // 54 : UART3 Error interrupt
    ADC0_IRQHandler,                     // 55 : ADC0 interrupt
    CMP0_IRQHandler,                     // 56 : CMP0 interrupt
    CMP1_IRQHandler,                     // 57 : CMP1 interrupt
    FTM0_IRQHandler,                     // 58 : FTM0 fault, overflow and channels interrupt
    FTM1_IRQHandler,                     // 59 : FTM1 fault, overflow and channels interrupt
    FTM2_IRQHandler,                     // 60 : FTM2 fault, overflow and channels interrupt
    CMT_IRQHandler,                      // 61 : CMT interrupt
    RTC_IRQHandler,                      // 62 : RTC interrupt
    RTC_Seconds_IRQHandler,              // 63 : RTC seconds interrupt
    PIT0_IRQHandler,                     // 64 : PIT timer channel 0 interrupt
    PIT1_IRQHandler,                     // 65 : PIT timer channel 1 interrupt
    PIT2_IRQHandler,                     // 66 : PIT timer channel 2 interrupt
    PIT3_IRQHandler,                     // 67 : PIT timer channel 3 interrupt
    PDB0_IRQHandler,                     // 68 : PDB0 Interrupt
    USB0_IRQHandler,                     // 69 : USB0 interrupt
    USBDCD_IRQHandler,                   // 70 : USBDCD Interrupt
    Reserved71_IRQHandler,               // 71 : Reserved interrupt
    DAC0_IRQHandler,                     // 72 : DAC0 interrupt
    MCG_IRQHandler,                      // 73 : MCG Interrupt
    LPTMR0_IRQHandler,                   // 74 : LPTimer interrupt
    PORTA_IRQHandler,                    // 75 : Port A interrupt
    PORTB_IRQHandler,                    // 76 : Port B interrupt
    PORTC_IRQHandler,                    // 77 : Port C interrupt
    PORTD_IRQHandler,                    // 78 : Port D interrupt
    PORTE_IRQHandler,                    // 79 : Port E interrupt
    SWI_IRQHandler,                      // 80 : Software interrupt
    SPI2_IRQHandler,                     // 81 : SPI2 Interrupt
    UART4_RX_TX_IRQHandler,              // 82 : UART4 Receive/Transmit interrupt
    UART4_ERR_IRQHandler,                // 83 : UART4 Error interrupt
    UART5_RX_TX_IRQHandler,              // 84 : UART5 Receive/Transmit interrupt
    UART5_ERR_IRQHandler,                // 85 : UART5 Error interrupt
    CMP2_IRQHandler,                     // 86 : CMP2 interrupt
    FTM3_IRQHandler,                     // 87 : FTM3 fault, overflow and channels interrupt
    DAC1_IRQHandler,                     // 88 : DAC1 interrupt
    ADC1_IRQHandler,                     // 89 : ADC1 interrupt
    I2C2_IRQHandler,                     // 90 : I2C2 interrupt
    CAN0_ORed_Message_buffer_IRQHandler, // 91 : CAN0 OR'd message buffers interrupt
    CAN0_Bus_Off_IRQHandler,             // 92 : CAN0 bus off interrupt
    CAN0_Error_IRQHandler,               // 93 : CAN0 error interrupt
    CAN0_Tx_Warning_IRQHandler,          // 94 : CAN0 Tx warning interrupt
    CAN0_Rx_Warning_IRQHandler,          // 95 : CAN0 Rx warning interrupt
    CAN0_Wake_Up_IRQHandler,             // 96 : CAN0 wake up interrupt
    SDHC_IRQHandler,                     // 97 : SDHC interrupt
    ENET_1588_Timer_IRQHandler,          // 98 : Ethernet MAC IEEE 1588 Timer Interrupt
    ENET_Transmit_IRQHandler,            // 99 : Ethernet MAC Transmit Interrupt
    ENET_Receive_IRQHandler,             // 100: Ethernet MAC Receive Interrupt
    ENET_Error_IRQHandler,               // 101: Ethernet MAC Error and miscelaneous Interrupt

}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__((section(".after_vectors.init_data"))) void data_init(unsigned int romstart, unsigned int start, unsigned int len)
{
  unsigned int *pulDest = (unsigned int *)start;
  unsigned int *pulSrc = (unsigned int *)romstart;
  unsigned int loop;
  for (loop = 0; loop < len; loop = loop + 4)
    *pulDest++ = *pulSrc++;
}

__attribute__((section(".after_vectors.init_bss"))) void bss_init(unsigned int start, unsigned int len)
{
  unsigned int *pulDest = (unsigned int *)start;
  unsigned int loop;
  for (loop = 0; loop < len; loop = loop + 4)
    *pulDest++ = 0;
}

