grygorek/FreeRTOS_cpp11/lib_test_nxp_mk64/startup_mk64f12.cpp
WEAK void DMA6_IRQHandler(void)
{
  DMA6_DriverIRQHandler();
}

WEAK void DMA7_IRQHandler(void)
{
  DMA7_DriverIRQHandler();
}

WEAK void DMA8_IRQHandler(void)
{
  DMA8_DriverIRQHandler();
}

WEAK void DMA9_IRQHandler(void)
{
  DMA9_DriverIRQHandler();
}

WEAK void DMA10_IRQHandler(void)
{
  DMA10_DriverIRQHandler();
}

WEAK void DMA11_IRQHandler(void)
{
  DMA11_DriverIRQHandler();
}

WEAK void DMA12_IRQHandler(void)
{
  DMA12_DriverIRQHandler();
}

WEAK void DMA13_IRQHandler(void)
{
  DMA13_DriverIRQHandler();
}

WEAK void DMA14_IRQHandler(void)
{
  DMA14_DriverIRQHandler();
}

WEAK void DMA15_IRQHandler(void)
{
  DMA15_DriverIRQHandler();
}

WEAK void DMA_Error_IRQHandler(void)
{
  DMA_Error_DriverIRQHandler();
}

WEAK void MCM_IRQHandler(void)
{
  MCM_DriverIRQHandler();
}

WEAK void FTFE_IRQHandler(void)
{
  FTFE_DriverIRQHandler();
}

WEAK void Read_Collision_IRQHandler(void)
{
  Read_Collision_DriverIRQHandler();
}

WEAK void LVD_LVW_IRQHandler(void)
{
  LVD_LVW_DriverIRQHandler();
}

WEAK void LLWU_IRQHandler(void)
{
  LLWU_DriverIRQHandler();
}

WEAK void WDOG_EWM_IRQHandler(void)
{
  WDOG_EWM_DriverIRQHandler();
}

WEAK void RNG_IRQHandler(void)
{
  RNG_DriverIRQHandler();
}

WEAK void I2C0_IRQHandler(void)
{
  I2C0_DriverIRQHandler();
}

WEAK void I2C1_IRQHandler(void)
{
  I2C1_DriverIRQHandler();
}

WEAK void SPI0_IRQHandler(void)
{
  SPI0_DriverIRQHandler();
}

WEAK void SPI1_IRQHandler(void)
{
  SPI1_DriverIRQHandler();
}

WEAK void I2S0_Tx_IRQHandler(void)
{
  I2S0_Tx_DriverIRQHandler();
}

WEAK void I2S0_Rx_IRQHandler(void)
{
  I2S0_Rx_DriverIRQHandler();
}

WEAK void UART0_LON_IRQHandler(void)
{
  UART0_LON_DriverIRQHandler();
}

WEAK void UART0_RX_TX_IRQHandler(void)
{
  UART0_RX_TX_DriverIRQHandler();
}

WEAK void UART0_ERR_IRQHandler(void)
{
  UART0_ERR_DriverIRQHandler();
}

WEAK void UART1_RX_TX_IRQHandler(void)
{
  UART1_RX_TX_DriverIRQHandler();
}

WEAK void UART1_ERR_IRQHandler(void)
{
  UART1_ERR_DriverIRQHandler();
}

WEAK void UART2_RX_TX_IRQHandler(void)
{
  UART2_RX_TX_DriverIRQHandler();
}

WEAK void UART2_ERR_IRQHandler(void)
{
  UART2_ERR_DriverIRQHandler();
}

WEAK void UART3_RX_TX_IRQHandler(void)
{
  UART3_RX_TX_DriverIRQHandler();
}

WEAK void UART3_ERR_IRQHandler(void)
{
  UART3_ERR_DriverIRQHandler();
}

WEAK void ADC0_IRQHandler(void)
{
  ADC0_DriverIRQHandler();
}

WEAK void CMP0_IRQHandler(void)
{
  CMP0_DriverIRQHandler();
}

WEAK void CMP1_IRQHandler(void)
{
  CMP1_DriverIRQHandler();
}

WEAK void FTM0_IRQHandler(void)
{
  FTM0_DriverIRQHandler();
}

WEAK void FTM1_IRQHandler(void)
{
  FTM1_DriverIRQHandler();
}

WEAK void FTM2_IRQHandler(void)
{
  FTM2_DriverIRQHandler();
}

WEAK void CMT_IRQHandler(void)
{
  CMT_DriverIRQHandler();
}

WEAK void RTC_IRQHandler(void)
{
  RTC_DriverIRQHandler();
}

WEAK void RTC_Seconds_IRQHandler(void)
{
  RTC_Seconds_DriverIRQHandler();
}

WEAK void PIT0_IRQHandler(void)
{
  PIT0_DriverIRQHandler();
}

WEAK void PIT1_IRQHandler(void)
{
  PIT1_DriverIRQHandler();
}

WEAK void PIT2_IRQHandler(void)
{
  PIT2_DriverIRQHandler();
}

WEAK void PIT3_IRQHandler(void)
{
  PIT3_DriverIRQHandler();
}

WEAK void PDB0_IRQHandler(void)
{
  PDB0_DriverIRQHandler();
}

WEAK void USB0_IRQHandler(void)
{
  USB0_DriverIRQHandler();
}

WEAK void USBDCD_IRQHandler(void)
{
  USBDCD_DriverIRQHandler();
}

WEAK void Reserved71_IRQHandler(void)
{
  Reserved71_DriverIRQHandler();
}

WEAK void DAC0_IRQHandler(void)
{
  DAC0_DriverIRQHandler();
}

WEAK void MCG_IRQHandler(void)
{
  MCG_DriverIRQHandler();
}

WEAK void LPTMR0_IRQHandler(void)
{
  LPTMR0_DriverIRQHandler();
}

WEAK void PORTA_IRQHandler(void)
{
  PORTA_DriverIRQHandler();
}

WEAK void PORTB_IRQHandler(void)
{
  PORTB_DriverIRQHandler();
}

WEAK void PORTC_IRQHandler(void)
{
  PORTC_DriverIRQHandler();
}

WEAK void PORTD_IRQHandler(void)
{
  PORTD_DriverIRQHandler();
}

WEAK void PORTE_IRQHandler(void)
{
  PORTE_DriverIRQHandler();
}

WEAK void SWI_IRQHandler(void)
{
  SWI_DriverIRQHandler();
}

WEAK void SPI2_IRQHandler(void)
{
  SPI2_DriverIRQHandler();
}

WEAK void UART4_RX_TX_IRQHandler(void)
{
  UART4_RX_TX_DriverIRQHandler();
}

WEAK void UART4_ERR_IRQHandler(void)
{
  UART4_ERR_DriverIRQHandler();
}

WEAK void UART5_RX_TX_IRQHandler(void)
{
  UART5_RX_TX_DriverIRQHandler();
}

WEAK void UART5_ERR_IRQHandler(void)
{
  UART5_ERR_DriverIRQHandler();
}

WEAK void CMP2_IRQHandler(void)
{
  CMP2_DriverIRQHandler();
}

WEAK void FTM3_IRQHandler(void)
{
  FTM3_DriverIRQHandler();
}

WEAK void DAC1_IRQHandler(void)
{
  DAC1_DriverIRQHandler();
}

WEAK void ADC1_IRQHandler(void)
{
  ADC1_DriverIRQHandler();
}

WEAK void I2C2_IRQHandler(void)
{
  I2C2_DriverIRQHandler();
}

WEAK void CAN0_ORed_Message_buffer_IRQHandler(void)
{
  CAN0_DriverIRQHandler();
}

WEAK void CAN0_Bus_Off_IRQHandler(void)
{
  CAN0_DriverIRQHandler();
}

WEAK void CAN0_Error_IRQHandler(void)
{
  CAN0_DriverIRQHandler();
}

WEAK void CAN0_Tx_Warning_IRQHandler(void)
{
  CAN0_DriverIRQHandler();
}

WEAK void CAN0_Rx_Warning_IRQHandler(void)
{
  CAN0_DriverIRQHandler();
}

WEAK void CAN0_Wake_Up_IRQHandler(void)
{
  CAN0_DriverIRQHandler();
}

WEAK void SDHC_IRQHandler(void)
{
  SDHC_DriverIRQHandler();
}

WEAK void ENET_1588_Timer_IRQHandler(void)
{
  ENET_1588_Timer_DriverIRQHandler();
}

WEAK void ENET_Transmit_IRQHandler(void)
{
  ENET_Transmit_DriverIRQHandler();
}

WEAK void ENET_Receive_IRQHandler(void)
{
  ENET_Receive_DriverIRQHandler();
}

WEAK void ENET_Error_IRQHandler(void)
{
  ENET_Error_DriverIRQHandler();
}

//*****************************************************************************

#if defined(DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
